In [1]:
import pandas as pd

#Load the CSV file into a DataFrame
df = pd.read_csv('Transaction_Data.csv') 
df.head()

,Transaction_ID,Customer_ID,Transaction_Date,Transaction_Amount,Transaction_Type
0,1,393,2023-01-01 00:00:00,3472.0,Purchase
1,2,826,2023-01-01 01:00:00,NaN,Bill Payment
2,3,916,2023-01-01 02:00:00,10.0,Purchase
3,4,109,2023-01-01 03:00:00,72.0,Investment
4,5,889,2023-01-01 04:00:00,1793.0,Investment

In [2]:
df[df['Transaction_Amount'].isna()==1]

,Transaction_ID,Customer_ID,Transaction_Date,Transaction_Amount,Transaction_Type
1,2,826,2023-01-01 01:00:00,NaN,Bill Payment
31,32,63,2023-01-02 07:00:00,NaN,Purchase
212,213,411,2023-01-09 20:00:00,NaN,Purchase
253,254,979,2023-01-11 13:00:00,NaN,Bill Payment
272,273,253,2023-01-12 08:00:00,NaN,Purchase
...,...,...,...,...,...
4691,4692,567,2023-07-15 11:00:00,NaN,Purchase
4846,4847,366,2023-07-21 22:00:00,NaN,Investment
4862,4863,460,2023-07-22 14:00:00,NaN,Investment
4876,4877,917,2023-07-23 04:00:00,NaN,Investment
4947,4948,864,2023-07-26 03:00:00,NaN,Bill Payment

In [5]:
df['Transaction_Amount'] = df['Transaction_Amount'].fillna(0)
df.head()

,Transaction_ID,Customer_ID,Transaction_Date,Transaction_Amount,Transaction_Type
0,1,393,2023-01-01 00:00:00,3472.0,Purchase
1,2,826,2023-01-01 01:00:00,0.0,Bill Payment
2,3,916,2023-01-01 02:00:00,10.0,Purchase
3,4,109,2023-01-01 03:00:00,72.0,Investment
4,5,889,2023-01-01 04:00:00,1793.0,Investment

In [6]:
df['Transaction_Type'].unique()

array(['Purchase', 'Bill Payment', 'Investment', 'Loan Payment'],
      dtype=object)